node {
  name: "batch_size"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "phase_train"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "batch_join/fifo_queue"
  op: "FIFOQueueV2"
  attr {
    key: "capacity"
    value {
      i: 1440
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT32
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
          dim {
            size: 160
          }
          dim {
            size: 160
          }
          dim {
            size: 3
          }
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "batch_join"
  op: "QueueDequeueUpToV2"
  input: "batch_join/fifo_queue"
  input: "batch_size"
  attr {
    key: "component_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT32
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "image_batch"
  op: "Identity"
  input: "batch_join"
}
node {
  name: "input"
  op: "Identity"
  input: "image_batch"
}
node {
  name: "label_batch"
  op: "Identity"
  input: "batch_join:1"
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/weights/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_1a_3x3/weights"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/Conv2D"
  op: "Conv2D"
  input: "input"
  input: "InceptionResnetV1/Conv2d_1a_3x3/weights/read"
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/beta/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/beta"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_mean"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_variance"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Switch"
  op: "Switch"
  input: "phase_train"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/switch_t"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Switch:1"
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/pred_id"
  op: "Identity"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/Conv2D"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/Conv2D"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/Const"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/Const"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm/Switch_2"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/beta/read"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm/Switch:1"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm/Switch_1:1"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm/Switch_2:1"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Const"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Const_1"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/Conv2D"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/Conv2D"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/Const"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/Const"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_2"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/beta/read"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_3"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_mean/read"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_4"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_variance/read"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1"
  op: "FusedBatchNorm"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_1"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_2"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_3"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_4"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Merge"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm"
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Merge_1"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1:1"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm:1"
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Merge_2"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1:2"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm:2"
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Switch"
  op: "Switch"
  input: "phase_train"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/switch_t"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Switch:1"
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/pred_id"
  op: "Identity"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg/sub/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_mean/read"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg/sub/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Merge_1"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Merge_1"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg/sub"
  op: "Sub"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg/sub/Switch:1"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg/sub/Switch_1:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg/mul"
  op: "Mul"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg/sub"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg/decay"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_mean/read"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg"
  op: "Sub"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg/Switch:1"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg/mul"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_variance/read"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Merge_2"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Merge_2"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch:1"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch_1:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/decay"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_variance/read"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg_1"
  op: "Sub"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/Switch:1"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/mul"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Identity/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Merge"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Merge"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Identity"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Identity/Switch:1"
  input: "^InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg"
  input: "^InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/AssignMovingAvg_1"
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Merge"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Merge"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Merge"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Switch_1"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Identity"
}
node {
  name: "InceptionResnetV1/Conv2d_1a_3x3/Relu"
  op: "Relu"
  input: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Merge"
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/weights/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2a_3x3/weights"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/Conv2D"
  op: "Conv2D"
  input: "InceptionResnetV1/Conv2d_1a_3x3/Relu"
  input: "InceptionResnetV1/Conv2d_2a_3x3/weights/read"
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/beta/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/beta"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_mean"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_variance"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Switch"
  op: "Switch"
  input: "phase_train"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/switch_t"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Switch:1"
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/pred_id"
  op: "Identity"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/Conv2D"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/Conv2D"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/Const"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/Const"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm/Switch_2"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/beta/read"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm/Switch:1"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm/Switch_1:1"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm/Switch_2:1"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Const"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Const_1"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/Conv2D"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/Conv2D"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/Const"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/Const"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_2"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/beta/read"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_3"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_mean/read"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_4"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_variance/read"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1"
  op: "FusedBatchNorm"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_1"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_2"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_3"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_4"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Merge"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm"
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Merge_1"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1:1"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm:1"
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Merge_2"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1:2"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm:2"
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Switch"
  op: "Switch"
  input: "phase_train"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/switch_t"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Switch:1"
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/pred_id"
  op: "Identity"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg/sub/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_mean/read"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg/sub/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Merge_1"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Merge_1"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg/sub"
  op: "Sub"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg/sub/Switch:1"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg/sub/Switch_1:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg/mul"
  op: "Mul"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg/sub"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg/decay"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_mean/read"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg"
  op: "Sub"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg/Switch:1"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg/mul"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_variance/read"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Merge_2"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Merge_2"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch:1"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch_1:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/decay"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_variance/read"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg_1"
  op: "Sub"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/Switch:1"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg_1/mul"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Identity/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Merge"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Merge"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Identity"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Identity/Switch:1"
  input: "^InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg"
  input: "^InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/AssignMovingAvg_1"
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Merge"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Merge"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Merge"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Switch_1"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Identity"
}
node {
  name: "InceptionResnetV1/Conv2d_2a_3x3/Relu"
  op: "Relu"
  input: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Merge"
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/weights/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2b_3x3/weights"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/Conv2D"
  op: "Conv2D"
  input: "InceptionResnetV1/Conv2d_2a_3x3/Relu"
  input: "InceptionResnetV1/Conv2d_2b_3x3/weights/read"
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/beta/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/beta"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_mean"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_variance"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Switch"
  op: "Switch"
  input: "phase_train"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/switch_t"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Switch:1"
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/pred_id"
  op: "Identity"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/Conv2D"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/Conv2D"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/Const"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/Const"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm/Switch_2"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/beta/read"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm/Switch:1"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm/Switch_1:1"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm/Switch_2:1"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Const"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Const_1"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/Conv2D"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/Conv2D"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/Const"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/Const"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_2"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/beta/read"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_3"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_mean/read"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_4"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_variance/read"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1"
  op: "FusedBatchNorm"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_1"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_2"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_3"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/Switch_4"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Merge"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm"
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Merge_1"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1:1"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm:1"
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Merge_2"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1:2"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm:2"
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Switch"
  op: "Switch"
  input: "phase_train"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/switch_t"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Switch:1"
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/pred_id"
  op: "Identity"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg/sub/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_mean/read"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg/sub/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Merge_1"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Merge_1"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg/sub"
  op: "Sub"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg/sub/Switch:1"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg/sub/Switch_1:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg/mul"
  op: "Mul"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg/sub"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg/decay"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_mean/read"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg"
  op: "Sub"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg/Switch:1"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg/mul"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_variance/read"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Merge_2"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Merge_2"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch:1"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub/Switch_1:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg_1/sub"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg_1/decay"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg_1/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_variance/read"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg_1"
  op: "Sub"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg_1/Switch:1"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg_1/mul"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Identity/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Merge"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Merge"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Identity"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Identity/Switch:1"
  input: "^InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg"
  input: "^InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/AssignMovingAvg_1"
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Merge"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Merge"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Merge"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Switch_1"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Identity"
}
node {
  name: "InceptionResnetV1/Conv2d_2b_3x3/Relu"
  op: "Relu"
  input: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Merge"
}
node {
  name: "InceptionResnetV1/MaxPool_3a_3x3/MaxPool"
  op: "MaxPool"
  input: "InceptionResnetV1/Conv2d_2b_3x3/Relu"
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/weights/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_3b_1x1/weights"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_3b_1x1/weights"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/Conv2D"
  op: "Conv2D"
  input: "InceptionResnetV1/MaxPool_3a_3x3/MaxPool"
  input: "InceptionResnetV1/Conv2d_3b_1x1/weights/read"
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/beta/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/beta"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/moving_mean"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/moving_variance"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/Switch"
  op: "Switch"
  input: "phase_train"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/switch_t"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/Switch:1"
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/pred_id"
  op: "Identity"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_3b_1x1/Conv2D"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_3b_1x1/Conv2D"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/Const"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/Const"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm/Switch_2"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/beta/read"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm/Switch:1"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm/Switch_1:1"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm/Switch_2:1"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/Const"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/Const_1"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_3b_1x1/Conv2D"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_3b_1x1/Conv2D"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/Switch_1"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/Const"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/Const"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/Switch_2"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/beta/read"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/Switch_3"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/moving_mean/read"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/Switch_4"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/moving_variance/read"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1"
  op: "FusedBatchNorm"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/Switch"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/Switch_1"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/Switch_2"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/Switch_3"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/Switch_4"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/Merge"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm"
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/Merge_1"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1:1"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm:1"
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/Merge_2"
  op: "Merge"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1:2"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm:2"
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond_1/Switch"
  op: "Switch"
  input: "phase_train"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond_1/switch_t"
  op: "Identity"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond_1/Switch:1"
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond_1/pred_id"
  op: "Identity"
  input: "phase_train"
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond_1/AssignMovingAvg/sub/Switch"
  op: "Switch"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/moving_mean/read"
  input: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond_1/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond_1/AssignMovingAvg/sub/Switch_1"
